Саракташ2/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыПоСерийнымНомерам</registerRecords>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладПолучатель</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйАртикул</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВязальщицаНаСайте</name>
      <type>
        <types>CatalogRef.Мастерицы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатПриемки</name>
      <type>
        <types>CatalogRef.РезультатыПриемки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Недочеты</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Недочет</name>
      <type>
        <types>CatalogRef.НедочетыПриПриемке</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Саракташ2/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/AccumulationRegisters/ЗапасыПоСерийнымНомерам/ЗапасыПоСерийнымНомерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗапасыПоСерийнымНомерам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/InformationRegisters/ДанныеСерийныхНомеров/ДанныеСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеСерийныхНомеров</name>
  <resources>
    <name>АртикулСтарый</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Вязальщица</name>
    <type>
      <types>CatalogRef.Мастерицы</types>
    </type>
  </resources>
  <resources>
    <name>ВязальщицаНаСайте</name>
    <type>
      <types>CatalogRef.Мастерицы</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Размер</name>
    <type>
      <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </resources>
  <resources>
    <name>Бирка</name>
    <type>
      <types>CatalogRef.Бирки</types>
    </type>
  </resources>
  <resources>
    <name>Приемка</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>EnumRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаЗаРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Саракташ2/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <predefined>
    <items>
      <name>РынокСаракташ</name>
      <description>Рынок Саракташ</description>
    </items>
    <items>
      <name>Саракташ</name>
      <description>Саракташ</description>
    </items>
  </predefined>
  <attributes>
    <name>ВыгружатьОстаткиСерийныхНомеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/Catalogs/РезультатыПриемки/РезультатыПриемки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РезультатыПриемки</name>
  <predefined>
    <items>
      <name>Брак</name>
      <description>Брак</description>
    </items>
    <items>
      <name>Опт</name>
      <description>Опт</description>
    </items>
    <items>
      <name>Принято</name>
      <description>Принято</description>
    </items>
  </predefined>
  <attributes>
    <name>СкладПриемки</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Catalog>

Саракташ2/src/Documents/ПеремещениеТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ТоварыНаСкладах Расход
	Движения.Запасы.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл   		
		Движение = Движения.Запасы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;		
		Движение.Склад = СкладОтправитель;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// регистр ТоварыНаСкладах Приход
	Движения.Запасы.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Запасы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ?(ЗначениеЗаполнено(ТекСтрокаТовары.НовыйАртикул)
		, ТекСтрокаТовары.НовыйАртикул
		, ТекСтрокаТовары.Номенклатура); 		
		Движение.Склад = ?(ЗначениеЗаполнено(ТекСтрокаТовары.СкладПолучатель)
		, ТекСтрокаТовары.СкладПолучатель
		, СкладПолучатель);
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	УчетСебестоимости.УчестьСебестоимость(ЭтотОбъект,Режим,Отказ);
	
	Движения.ЗапасыПоСерийнымНомерам.Записывать = Истина;  
	Если СкладОтправитель = Справочники.Склады.Саракташ Тогда
							
		Для Каждого СтрокаТовар Из Товары Цикл
									
			Движение = Движения.ЗапасыПоСерийнымНомерам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.СерийныйНомер = СтрокаТовар.СерийныйНомер;   		
			Движение.Склад = СкладОтправитель;
			Движение.Количество = СтрокаТовар.Количество;
			
			Движение = Движения.ЗапасыПоСерийнымНомерам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.СерийныйНомер = СтрокаТовар.СерийныйНомер;   		
			Движение.Склад = ?(ЗначениеЗаполнено(СтрокаТовар.СкладПолучатель)
			, СтрокаТовар.СкладПолучатель
			, СкладПолучатель);;
			Движение.Количество = СтрокаТовар.Количество;
			
			Если ЗначениеЗаполнено(СтрокаТовар.НовыйАртикул) 
				И СтрокаТовар.СерийныйНомер.Владелец <> СтрокаТовар.НовыйАртикул Тогда
				СерийныйНомерОбъект = СтрокаТовар.СерийныйНомер.ПолучитьОбъект();
				СерийныйНомерОбъект.Владелец = СтрокаТовар.НовыйАртикул;
				СерийныйНомерОбъект.ОбменДанными.Загрузка = Истина;
				СерийныйНомерОбъект.Записать();
			КонецЕсли;
			
			Набор = РегистрыСведений.ДанныеСерийныхНомеров.СоздатьНаборЗаписей();
			Набор.Отбор.СерийныйНомер.Установить(СтрокаТовар.СерийныйНомер);
			Набор.Прочитать();
			Если Набор.Количество() И Набор[0].ВязальщицаНаСайте <> СтрокаТовар.ВязальщицаНаСайте Тогда
				Набор[0].ВязальщицаНаСайте = СтрокаТовар.ВязальщицаНаСайте;
				Набор.Записать();	
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;  
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		// Заполнение шапки
		СкладПолучатель = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		Если СкладПолучатель.Код = "000000002" Тогда //Оптовый
			СкладОтправитель = Справочники.Склады.НайтиПоКоду("000000001");
		Иначе
			СкладОтправитель = Справочники.Склады.НайтиПоКоду("000000002");
		КонецЕсли;
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СкладПолучатель) Тогда
		СкладПолучатель = Константы.ОсновнойСклад.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СкладПоУмолчанию = Константы.ОсновнойСклад.Получить();
	СкладБрак = Константы.СкладБрак.Получить();
	СкладОптовый = Константы.ОптовыйСклад.Получить();
	
	Если Не ЗначениеЗаполнено(СкладПоУмолчанию) Тогда
		ВызватьИсключение "В настройках программы не задан основной склад";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СкладБрак) Тогда
		ВызватьИсключение "В настройках программы не задан склад брака";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СкладОптовый) Тогда
		ВызватьИсключение "В настройках программы не задан оптовый склад";
	КонецЕсли;   
	
	Для Каждого СтрокаТовар Из Товары Цикл
		
		СтрокаТовар.СкладПолучатель = СкладПоУмолчанию;
		Если СтрокаТовар.РезультатПриемки = Справочники.РезультатыПриемки.Брак Тогда
			СтрокаТовар.СкладПолучатель = СкладБрак;
		ИначеЕсли СтрокаТовар.РезультатПриемки = Справочники.РезультатыПриемки.Опт Тогда
			 СтрокаТовар.СкладПолучатель = СкладОптовый;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
